<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SupplierSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
     {
        DB::table('suppliers')->delete();
        DB::statement("INSERT INTO `suppliers` (`id`, `supplier_name`, `region`, `min_market_price`, `max_market_price`, `min_transaction_price`, `max_transaction_price`, `currency`, `created_at`, `updated_at`) VALUES
        (1, 'genemol', 'ARG/ARS', 200.00, 200.90, 202.00, 205.00, 'ARS', '2022-04-19 08:14:23', '2022-05-03 04:46:50'),
        (2, '资金安全24h', '中国/CNY', 6.35, 6.42, 6.47, 6.60, 'CNY', '2022-04-19 08:15:15', '2022-04-28 21:03:15'),
        (3, '⭐️Crypto SK⭐️', 'HK/HKD', 7.55, 7.65, 7.80, 7.94, 'HKD', '2022-04-19 08:19:10', '2022-04-28 21:08:28'),
        (4, 'TradingSignalGroup', 'UAE/AED', 3.55, 3.70, 3.80, 4.00, 'AED', '2022-04-19 08:21:24', '2022-04-28 01:51:42'),
        (5, 'BEST_CRYPTO', '日本/JPY', 120.00, 125.00, 129.00, 133.00, 'JPY', '2022-04-28 01:52:59', '2022-04-28 21:29:07'),
        (6, 'عبدالعزيز', 'الكويت/KWD', 0.29, 0.31, 0.31, 0.31, 'KWD', '2022-04-28 01:54:55', '2022-04-28 21:41:20'),
        (7, 'ASDAR-IT', 'UAE/AED', 3.49, 3.65, 3.81, 4.00, 'AED', '2022-04-28 01:56:10', NULL),
        (8, 'ArmEx', 'Armenian/AMD', 448.00, 458.00, 490.00, 500.12, 'AMD', '2022-04-28 01:59:49', NULL),
        (9, 'Crypto Trading', 'AUS/AUD', 1.32, 1.42, 1.48, 1.60, 'AUD', '2022-04-28 02:05:20', NULL),
        (10, 'AlHamadExchange', 'BHR/BHD', 0.38, 0.38, 0.38, 0.39, 'BHD', '2022-04-28 02:12:32', NULL),
        (11, 'Neo_Trade', 'USA/USD', 0.98, 0.99, 1.00, 1.12, 'USD', '2022-04-28 21:47:26', NULL),
        (12, 'UNDERSUN', 'USA/USD', 0.98, 0.99, 1.00, 1.12, 'USD', '2022-04-28 21:48:37', NULL),
        (13, '⚡ Exchanger ☀☀☀☀☀', 'Việt Nam/VND', 19362.00, 20000.00, 23000.00, 23815.00, 'VND', '2022-04-28 21:54:55', NULL),
        (14, 'Guatexchange', 'Guatremala/GTQ', 7.10, 7.20, 7.44, 8.00, 'GTQ', '2022-04-28 21:58:16', NULL),
        (15, 'Arkadas_Traders', 'پاکستان/PKR', 170.00, 175.00, 180.00, 190.00, 'PKR', '2022-04-28 22:02:30', NULL),
        (16, 'TG_trader', 'NPL/NPR', 125.14, 126.52, 129.00, 135.21, 'NPR', '2022-05-01 01:15:13', NULL),
        (17, 'لإنجاز ✫ الرقمي', 'العربيه السعوديه/SAR', 3.85, 3.90, 4.10, 4.50, 'SAR', '2022-05-01 01:18:59', NULL),
        (18, 'FAST-SERVICE', 'العربيه السعوديه/SAR', 3.92, 3.97, 4.20, 4.50, 'SAR', '2022-05-01 01:20:30', NULL),
        (19, '德德 實體店認證幣商', 'TWN/TWD', 27.59, 28.40, 29.99, 31.10, 'TWD', '2022-05-01 01:25:31', NULL),
        (20, 'Secure Exchange', 'Uruguay/UYU', 41.60, 42.20, 42.99, 43.40, 'UYU', '2022-05-01 01:27:57', NULL),
        (21, 'mamaforChrist', 'CFA/XAF', 640.24, 645.04, 650.10, 655.50, 'XAF', '2022-05-01 01:30:21', NULL),
        (22, 'Chaiwat ปังปุริเย่', 'ประเทศไทย/THB', 32.50, 33.02, 33.60, 33.90, 'THB', '2022-05-01 01:33:32', NULL),
        (23, 'MANSOUR منصور', 'العربيه السعوديه/SAR', 3.92, 4.05, 4.19, 4.50, 'SAR', '2022-05-01 01:35:44', NULL),
        (24, 'MANSOUR منصور', 'العربيه السعوديه/SAR', 3.91, 3.95, 4.00, 4.10, 'SAR', '2022-05-03 04:52:44', NULL),
        (25, 'PayGo', 'україни/UAH', 30.14, 30.40, 32.01, 33.11, 'UAH', '2022-05-03 04:59:37', NULL),
        (26, 'Trayder007', 'USA/USD', 0.98, 1.00, 1.10, 1.14, 'USD', '2022-05-03 05:03:16', NULL),
        (27, 'SWIPE™️', '日本/JPY', 129.01, 130.04, 133.15, 136.38, 'JPY', '2022-05-04 22:34:13', NULL),
        (28, 'Rockykanera', 'इंडिया/INR', 78.01, 78.10, 80.00, 80.62, 'INR', '2022-05-04 22:37:58', NULL),
        (29, 'LORDWIN', 'GHANA/GHS', 8.02, 8.15, 9.01, 9.15, 'GHS', '2022-05-04 22:45:18', NULL),
        (30, 'bk', 'ETHIOPIA/ETB', 70.99, 71.20, 72.10, 73.50, 'ETB', '2022-05-10 21:55:32', NULL),
        (31, 'Zura', 'GL/GEL', 2.85, 2.90, 3.01, 3.07, 'GEL', '2022-05-10 21:59:19', NULL),
        (32, 'Bogdan', 'ROMÂNIA/RON', 4.40, 4.50, 4.60, 4.75, 'RON', '2022-05-10 23:17:01', NULL),
        (33, 'SKILLED_TRADER', 'Morocco/MAD', 10.45, 10.53, 10.60, 10.78, 'MAD', '2022-05-13 21:13:13', NULL),
        (34, '⭐Cryptox⭐', 'سلطنة عمان/OMR', 0.39, 0.39, 0.40, 0.40, 'OMR', '2022-05-13 21:16:29', NULL),
        (35, '7⏰24 Crypto⭐İBRAHİM', 'HİNDİ/TRY', 15.20, 15.29, 15.40, 15.87, 'TRY', '2022-05-14 13:16:31', NULL)
    ");
     }
}
